In [13]:
import pandas as pd

#### Limpieza de datos

In [17]:
ventas = {
    'ID_producto': [101, 102, 103, 104, 102],            # ID repetido (102)
    'cantidad_vendida': [10, None, 5, 8, 10],           # Valor faltante (None) y cantidad repetida (10)
    'precio': [100.0, 150.0, None, 200.0, 150.0]        # Valor faltante (None) y precio repetido (150.0)
}

In [31]:
df_vtas = pd.DataFrame(ventas)
df_vtas

   ID_producto  cantidad_vendida  precio
0          101              10.0   100.0
1          102               NaN   150.0
2          103               5.0     NaN
3          104               8.0   200.0
4          102              10.0   150.0

In [21]:
df_vtas.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   ID_producto       5 non-null      int64
 1   cantidad_vendida  4 non-null      float64
 2   precio            4 non-null      float64
dtypes: float64(2), int64(1)
memory usage: 252.0 bytes

In [23]:
df_vtas.isnull() #devuelve true si es nulo cada elemento

   ID_producto  cantidad_vendida  precio
0        False             False   False
1        False              True   False
2        False             False    True
3        False             False   False
4        False             False   False

In [25]:
df_vtas.isnull().sum() #nos suma la cantidad de nulos de cada columna

ID_producto         0
cantidad_vendida    1
precio              1
dtype: int64

#### DEPENDIENDO EL DATAFRAME U OBJETIVO DE LA MISMA, PUEDO TOMAR LA DESICION DE ELIMINAR VALORES NULOS
#### O RELLENARLOS CON ALGUN VALOR

In [27]:
df_vts_eliminados = df_vtas.dropna() #Devolver un nuevo marco de datos sin celdas vac√≠as:
df_vts_eliminados

   ID_producto  cantidad_vendida  precio
0          101              10.0   100.0
3          104               8.0   200.0
4          102              10.0   150.0

In [29]:
valores_nuevos = {
    "cantidad_vendida": 0,
    "precio" : df_vtas["precio"].mean()
    #para no alterar valores poniendo 0, como es precio, hago un promedio de los precios de las columnas
}
df_vtas_limpio = df_vtas.fillna(valores_nuevos)
df_vtas_limpio

   ID_producto  cantidad_vendida  precio
0          101              10.0   100.0
1          102               0.0   150.0
2          103               5.0   150.0
3          104               8.0   200.0
4          102              10.0   150.0

In [41]:
# Creaci√≥n de un DataFrame de ejemplo con valores nulos
data = {
    "producto": ["A", "B", "C", "D", "E"],
    "cantidad_vendida": [10, None, 20, None, 15],
    "precio": [100.5, 200.75, None, 150.0, None]
}

# Creaci√≥n del DataFrame
df_ventas = pd.DataFrame(data)
df_ventas

  producto  cantidad_vendida  precio
0        A              10.0  100.50
1        B               NaN  200.75
2        C              20.0     NaN
3        D               NaN  150.00
4        E              15.0     NaN

In [43]:
df_vtas.isnull().sum() #compruebo cuanto/si hay nulos para reemplazar

producto            0
cantidad_vendida    2
precio              2
dtype: int64

In [35]:
# Creo un nuevo Diccionario con los valores nuevos para reemplazar los NaN
valores_nuevos = {
    "cantidad_vendida": 0,  # Rellenamos con 0 las ventas faltantes
    "precio": df_vtas["precio"].mean()  # Rellenamos con el promedio de precios ya cargados
}

# Rellenar los NaN usando el diccionario
df_vtas_limpio = df_vtas.fillna(valores_nuevos) #fillna()identifica autom. las posiciones donde hay valores nulos (NaN) 
#dentro del DataFrame y reemplaza con los valores que le indiques, en este caso un dicc con dos clave valor

df_vtas_limpio

  producto  cantidad_vendida      precio
0        A              10.0  100.500000
1        B               0.0  200.750000
2        C              20.0  150.416667
3        D               0.0  150.000000
4        E              15.0  150.416667

In [45]:
df_vtas_limpio["cantidad_vendida"] = df_vtas_limpio["cantidad_vendida"].astype(int)
df_vtas_limpio

   ID_producto  cantidad_vendida  precio
0          101                10   100.0
1          102                 0   150.0
2          103                 5   150.0
3          104                 8   200.0
4          102                10   150.0

In [49]:
df_unicos = df_vtas_limpio.drop_duplicates() #registros completos complemtamente iguales
df_unicos

   ID_producto  cantidad_vendida  precio
0          101                10   100.0
1          102                 0   150.0
2          103                 5   150.0
3          104                 8   200.0
4          102                10   150.0

In [53]:
df_unicos = df_vtas_limpio.drop_duplicates(subset="ID_producto") #elimina columna/seccion q tenga alguna registro = con una posterior 
df_unicos

   ID_producto  cantidad_vendida  precio
0          101                10   100.0
1          102                 0   150.0
2          103                 5   150.0
3          104                 8   200.0